{"keras_version": "2.2.0", "backend": "tensorflow", "config": [{"config": {"use_bias": true, "padding": "same", "kernel_regularizer": null, "trainable": true, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "filters": 32, "bias_constraint": null, "kernel_size": [3, 4], "activity_regularizer": null, "batch_input_shape": [null, 36, 4, 1], "name": "conv2d_1", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [1, 1], "padding": "same", "data_format": "channels_last", "trainable": true, "pool_size": [5, 1]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "padding": "valid", "kernel_regularizer": null, "trainable": true, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "filters": 16, "bias_constraint": null, "kernel_size": [5, 4], "activity_regularizer": null, "batch_input_shape": [null, 36, 4, 1], "name": "conv2d_2", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [1, 1], "padding": "same", "data_format": "channels_last", "trainable": true, "pool_size": [5, 1]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 64, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "name": "dense_2", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 2, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}