{"config": [{"config": {"bias_constraint": null, "filters": 32, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "data_format": "channels_last", "trainable": true, "padding": "same", "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [6, 4], "strides": [1, 1], "dtype": "float32", "batch_input_shape": [null, 36, 4, 1], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [5, 1], "strides": [1, 1], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "filters": 16, "kernel_constraint": {"config": {"max_value": 3, "axis": 0}, "class_name": "MaxNorm"}, "data_format": "channels_last", "trainable": true, "padding": "valid", "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [8, 4], "strides": [1, 1], "dtype": "float32", "batch_input_shape": [null, 36, 4, 1], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [5, 1], "strides": [1, 1], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 128, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activation": "sigmoid", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 2, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.2.0", "class_name": "Sequential", "backend": "tensorflow"}