{"keras_version": "2.2.0", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 36, 4, 1], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"filters": 16, "padding": "same", "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 4], "kernel_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"filters": 4, "padding": "same", "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [10, 4], "kernel_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"filters": 8, "padding": "same", "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [5, 4], "kernel_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 4], "name": "max_pooling2d_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "pool_size": [10, 4], "name": "max_pooling2d_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "same", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 4], "name": "max_pooling2d_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "concatenate_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"filters": 32, "padding": "valid", "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [3, 4], "kernel_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "pool_size": [3, 1], "name": "max_pooling2d_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"filters": 16, "padding": "valid", "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_size": [5, 1], "kernel_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"use_bias": true, "trainable": true, "activation": "relu", "units": 64, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"use_bias": true, "trainable": true, "activation": "softmax", "units": 2, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "class_name": "Model"}