{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "activation": "relu", "activity_regularizer": null, "filters": 32, "dtype": "float32", "kernel_size": [3, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 36, 4, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "padding": "same", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [3, 1], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "kernel_size": [3, 1], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "padding": "same", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [3, 1], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 64, "kernel_size": [5, 2], "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "padding": "same", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [5, 1], "strides": [1, 1], "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.3}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "kernel_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true}}]}