{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 36, 4, 1], "sparse": false}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_1", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "padding": "same", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 4], "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "padding": "same", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 4], "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [3, 4], "strides": [1, 1], "name": "max_pooling2d_1", "padding": "same", "trainable": true}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [3, 4], "strides": [1, 1], "name": "max_pooling2d_2", "padding": "same", "trainable": true}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}]]], "config": {"axis": 3, "trainable": true, "name": "concatenate_1"}, "class_name": "Concatenate", "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 4], "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [3, 1], "strides": [1, 1], "name": "max_pooling2d_3", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "units": 32, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "units": 5, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense", "name": "dense_2"}], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.2.0", "class_name": "Model"}