{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "padding": "same", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "dtype": "float32", "filters": 32, "name": "conv2d_1", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 1], "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 36, 4, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [3, 1], "padding": "same", "data_format": "channels_last", "trainable": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 1], "filters": 64, "name": "conv2d_2", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [3, 1], "padding": "same", "data_format": "channels_last", "trainable": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [5, 2], "filters": 64, "name": "conv2d_3", "bias_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [5, 1], "padding": "same", "data_format": "channels_last", "trainable": true, "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "units": 64, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.3, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "name": "dense_2", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "units": 64, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "name": "dense_3", "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "units": 32, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "name": "dense_4", "kernel_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "units": 2, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.2.0"}