{"class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 4], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 9.181399643776235e-05, "seed": null, "mean": 0}}, "filters": 16, "batch_input_shape": [null, 36, 4, 1], "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "dtype": "float32", "bias_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "name": "conv2d_1", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [3, 1], "strides": [1, 1], "name": "max_pooling2d_1", "padding": "same"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.005456466924937575, "seed": null, "mean": 0}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.0, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "units": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "activation": "sigmoid", "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null}}], "backend": "tensorflow"}