{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "bias_constraint": null, "trainable": true, "name": "conv2d_1", "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "batch_input_shape": [null, 36, 4, 1], "filters": 32, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_size": [3, 4], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "name": "max_pooling2d_1", "pool_size": [5, 1], "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "bias_constraint": null, "trainable": true, "name": "conv2d_2", "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "batch_input_shape": [null, 36, 4, 1], "filters": 16, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_size": [5, 4], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "name": "max_pooling2d_2", "pool_size": [5, 1], "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "units": 64, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "units": 5, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "sigmoid", "bias_regularizer": null}}], "keras_version": "2.2.0", "backend": "tensorflow"}