{"class_name": "Model", "keras_version": "2.2.0", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 36, 4, 1], "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"filters": 16, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 4]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"filters": 16, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_2", "kernel_size": [10, 4]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"filters": 16, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_3", "kernel_size": [5, 4]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"filters": 16, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_4", "kernel_size": [6, 4]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"filters": 16, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_5", "kernel_size": [8, 4]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [3, 4]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [10, 4]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [5, 4]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "name": "max_pooling2d_4", "pool_size": [6, 4]}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "name": "max_pooling2d_5", "pool_size": [8, 4]}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}], ["max_pooling2d_4", 0, 0, {}], ["max_pooling2d_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0, "stddev": 0.1}}, "activation": "relu", "activity_regularizer": null, "name": "conv2d_6", "kernel_size": [3, 4]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "name": "max_pooling2d_6", "pool_size": [3, 1]}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 64, "name": "dense_1", "activation": "relu"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 5, "name": "dense_2", "activation": "softmax"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}]}, "backend": "tensorflow"}